qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/ssi.h
#define SSI_RISR_RXOIR_RESET  _u(0x0)
#define SSI_RISR_RXOIR_BITS   _u(0x00000008)
#define SSI_RISR_RXOIR_MSB    _u(3)
#define SSI_RISR_RXOIR_LSB    _u(3)
#define SSI_RISR_RXOIR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SSI_RISR_RXUIR
// Description : Receive FIFO underflow raw interrupt status
#define SSI_RISR_RXUIR_RESET  _u(0x0)
#define SSI_RISR_RXUIR_BITS   _u(0x00000004)
#define SSI_RISR_RXUIR_MSB    _u(2)
#define SSI_RISR_RXUIR_LSB    _u(2)
#define SSI_RISR_RXUIR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SSI_RISR_TXOIR
// Description : Transmit FIFO overflow raw interrupt status
#define SSI_RISR_TXOIR_RESET  _u(0x0)
#define SSI_RISR_TXOIR_BITS   _u(0x00000002)
#define SSI_RISR_TXOIR_MSB    _u(1)
#define SSI_RISR_TXOIR_LSB    _u(1)
#define SSI_RISR_TXOIR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : SSI_RISR_TXEIR
// Description : Transmit FIFO empty raw interrupt status
#define SSI_RISR_TXEIR_RESET  _u(0x0)
#define SSI_RISR_TXEIR_BITS   _u(0x00000001)
#define SSI_RISR_TXEIR_MSB    _u(0)
#define SSI_RISR_TXEIR_LSB    _u(0)
#define SSI_RISR_TXEIR_ACCESS "RO"
// =============================================================================
// Register    : SSI_TXOICR
// Description : TX FIFO overflow interrupt clear
//               Clear-on-read transmit FIFO overflow interrupt
#define SSI_TXOICR_OFFSET _u(0x00000038)
#define SSI_TXOICR_BITS   _u(0x00000001)
#define SSI_TXOICR_RESET  _u(0x00000000)
#define SSI_TXOICR_MSB    _u(0)
#define SSI_TXOICR_LSB    _u(0)
#define SSI_TXOICR_ACCESS "RO"
// =============================================================================
// Register    : SSI_RXOICR
// Description : RX FIFO overflow interrupt clear
//               Clear-on-read receive FIFO overflow interrupt
#define SSI_RXOICR_OFFSET _u(0x0000003c)
#define SSI_RXOICR_BITS   _u(0x00000001)
#define SSI_RXOICR_RESET  _u(0x00000000)
#define SSI_RXOICR_MSB    _u(0)
#define SSI_RXOICR_LSB    _u(0)
#define SSI_RXOICR_ACCESS "RO"
// =============================================================================
// Register    : SSI_RXUICR
// Description : RX FIFO underflow interrupt clear
//               Clear-on-read receive FIFO underflow interrupt
#define SSI_RXUICR_OFFSET _u(0x00000040)
#define SSI_RXUICR_BITS   _u(0x00000001)
#define SSI_RXUICR_RESET  _u(0x00000000)
#define SSI_RXUICR_MSB    _u(0)
#define SSI_RXUICR_LSB    _u(0)
#define SSI_RXUICR_ACCESS "RO"
// =============================================================================
// Register    : SSI_MSTICR
// Description : Multi-master interrupt clear
//               Clear-on-read multi-master contention interrupt
#define SSI_MSTICR_OFFSET _u(0x00000044)
#define SSI_MSTICR_BITS   _u(0x00000001)
#define SSI_MSTICR_RESET  _u(0x00000000)
#define SSI_MSTICR_MSB    _u(0)
#define SSI_MSTICR_LSB    _u(0)
#define SSI_MSTICR_ACCESS "RO"
// =============================================================================
// Register    : SSI_ICR
// Description : Interrupt clear
//               Clear-on-read all active interrupts
#define SSI_ICR_OFFSET _u(0x00000048)
#define SSI_ICR_BITS   _u(0x00000001)
#define SSI_ICR_RESET  _u(0x00000000)
#define SSI_ICR_MSB    _u(0)
#define SSI_ICR_LSB    _u(0)
#define SSI_ICR_ACCESS "RO"
// =============================================================================
// Register    : SSI_DMACR
// Description : DMA control
#define SSI_DMACR_OFFSET _u(0x0000004c)
#define SSI_DMACR_BITS   _u(0x00000003)
#define SSI_DMACR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SSI_DMACR_TDMAE
// Description : Transmit DMA enable
#define SSI_DMACR_TDMAE_RESET  _u(0x0)
#define SSI_DMACR_TDMAE_BITS   _u(0x00000002)
#define SSI_DMACR_TDMAE_MSB    _u(1)
#define SSI_DMACR_TDMAE_LSB    _u(1)
#define SSI_DMACR_TDMAE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_DMACR_RDMAE
// Description : Receive DMA enable
#define SSI_DMACR_RDMAE_RESET  _u(0x0)
#define SSI_DMACR_RDMAE_BITS   _u(0x00000001)
#define SSI_DMACR_RDMAE_MSB    _u(0)
#define SSI_DMACR_RDMAE_LSB    _u(0)
#define SSI_DMACR_RDMAE_ACCESS "RW"
// =============================================================================
// Register    : SSI_DMATDLR
// Description : DMA TX data level
#define SSI_DMATDLR_OFFSET _u(0x00000050)
#define SSI_DMATDLR_BITS   _u(0x000000ff)
#define SSI_DMATDLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SSI_DMATDLR_DMATDL
// Description : Transmit data watermark level
#define SSI_DMATDLR_DMATDL_RESET  _u(0x00)
#define SSI_DMATDLR_DMATDL_BITS   _u(0x000000ff)
#define SSI_DMATDLR_DMATDL_MSB    _u(7)
#define SSI_DMATDLR_DMATDL_LSB    _u(0)
#define SSI_DMATDLR_DMATDL_ACCESS "RW"
// =============================================================================
// Register    : SSI_DMARDLR
// Description : DMA RX data level
#define SSI_DMARDLR_OFFSET _u(0x00000054)
#define SSI_DMARDLR_BITS   _u(0x000000ff)
#define SSI_DMARDLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SSI_DMARDLR_DMARDL
// Description : Receive data watermark level (DMARDLR+1)
#define SSI_DMARDLR_DMARDL_RESET  _u(0x00)
#define SSI_DMARDLR_DMARDL_BITS   _u(0x000000ff)
#define SSI_DMARDLR_DMARDL_MSB    _u(7)
#define SSI_DMARDLR_DMARDL_LSB    _u(0)
#define SSI_DMARDLR_DMARDL_ACCESS "RW"
// =============================================================================
// Register    : SSI_IDR
// Description : Identification register
#define SSI_IDR_OFFSET _u(0x00000058)
#define SSI_IDR_BITS   _u(0xffffffff)
#define SSI_IDR_RESET  _u(0x51535049)
// -----------------------------------------------------------------------------
// Field       : SSI_IDR_IDCODE
// Description : Peripheral dentification code
#define SSI_IDR_IDCODE_RESET  _u(0x51535049)
#define SSI_IDR_IDCODE_BITS   _u(0xffffffff)
#define SSI_IDR_IDCODE_MSB    _u(31)
#define SSI_IDR_IDCODE_LSB    _u(0)
#define SSI_IDR_IDCODE_ACCESS "RO"
// =============================================================================
// Register    : SSI_SSI_VERSION_ID
// Description : Version ID
#define SSI_SSI_VERSION_ID_OFFSET _u(0x0000005c)
#define SSI_SSI_VERSION_ID_BITS   _u(0xffffffff)
#define SSI_SSI_VERSION_ID_RESET  _u(0x3430312a)
// -----------------------------------------------------------------------------
// Field       : SSI_SSI_VERSION_ID_SSI_COMP_VERSION
// Description : SNPS component version (format X.YY)
#define SSI_SSI_VERSION_ID_SSI_COMP_VERSION_RESET  _u(0x3430312a)
#define SSI_SSI_VERSION_ID_SSI_COMP_VERSION_BITS   _u(0xffffffff)
#define SSI_SSI_VERSION_ID_SSI_COMP_VERSION_MSB    _u(31)
#define SSI_SSI_VERSION_ID_SSI_COMP_VERSION_LSB    _u(0)
#define SSI_SSI_VERSION_ID_SSI_COMP_VERSION_ACCESS "RO"
// =============================================================================
// Register    : SSI_DR0
// Description : Data Register 0 (of 36)
#define SSI_DR0_OFFSET _u(0x00000060)
#define SSI_DR0_BITS   _u(0xffffffff)
#define SSI_DR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SSI_DR0_DR
// Description : First data register of 36
#define SSI_DR0_DR_RESET  _u(0x00000000)
#define SSI_DR0_DR_BITS   _u(0xffffffff)
#define SSI_DR0_DR_MSB    _u(31)
#define SSI_DR0_DR_LSB    _u(0)
#define SSI_DR0_DR_ACCESS "RW"
// =============================================================================
// Register    : SSI_RX_SAMPLE_DLY
// Description : RX sample delay
#define SSI_RX_SAMPLE_DLY_OFFSET _u(0x000000f0)
#define SSI_RX_SAMPLE_DLY_BITS   _u(0x000000ff)
#define SSI_RX_SAMPLE_DLY_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SSI_RX_SAMPLE_DLY_RSD
// Description : RXD sample delay (in SCLK cycles)
#define SSI_RX_SAMPLE_DLY_RSD_RESET  _u(0x00)
#define SSI_RX_SAMPLE_DLY_RSD_BITS   _u(0x000000ff)
#define SSI_RX_SAMPLE_DLY_RSD_MSB    _u(7)
#define SSI_RX_SAMPLE_DLY_RSD_LSB    _u(0)
#define SSI_RX_SAMPLE_DLY_RSD_ACCESS "RW"
// =============================================================================
// Register    : SSI_SPI_CTRLR0
// Description : SPI control
#define SSI_SPI_CTRLR0_OFFSET _u(0x000000f4)
#define SSI_SPI_CTRLR0_BITS   _u(0xff07fb3f)
#define SSI_SPI_CTRLR0_RESET  _u(0x03000000)
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_XIP_CMD
// Description : SPI Command to send in XIP mode (INST_L = 8-bit) or to append
//               to Address (INST_L = 0-bit)
#define SSI_SPI_CTRLR0_XIP_CMD_RESET  _u(0x03)
#define SSI_SPI_CTRLR0_XIP_CMD_BITS   _u(0xff000000)
#define SSI_SPI_CTRLR0_XIP_CMD_MSB    _u(31)
#define SSI_SPI_CTRLR0_XIP_CMD_LSB    _u(24)
#define SSI_SPI_CTRLR0_XIP_CMD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_SPI_RXDS_EN
// Description : Read data strobe enable
#define SSI_SPI_CTRLR0_SPI_RXDS_EN_RESET  _u(0x0)
#define SSI_SPI_CTRLR0_SPI_RXDS_EN_BITS   _u(0x00040000)
#define SSI_SPI_CTRLR0_SPI_RXDS_EN_MSB    _u(18)
#define SSI_SPI_CTRLR0_SPI_RXDS_EN_LSB    _u(18)
#define SSI_SPI_CTRLR0_SPI_RXDS_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_INST_DDR_EN
// Description : Instruction DDR transfer enable
#define SSI_SPI_CTRLR0_INST_DDR_EN_RESET  _u(0x0)
#define SSI_SPI_CTRLR0_INST_DDR_EN_BITS   _u(0x00020000)
#define SSI_SPI_CTRLR0_INST_DDR_EN_MSB    _u(17)
#define SSI_SPI_CTRLR0_INST_DDR_EN_LSB    _u(17)
#define SSI_SPI_CTRLR0_INST_DDR_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_SPI_DDR_EN
// Description : SPI DDR transfer enable
#define SSI_SPI_CTRLR0_SPI_DDR_EN_RESET  _u(0x0)
#define SSI_SPI_CTRLR0_SPI_DDR_EN_BITS   _u(0x00010000)
#define SSI_SPI_CTRLR0_SPI_DDR_EN_MSB    _u(16)
#define SSI_SPI_CTRLR0_SPI_DDR_EN_LSB    _u(16)
#define SSI_SPI_CTRLR0_SPI_DDR_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_WAIT_CYCLES
// Description : Wait cycles between control frame transmit and data reception
//               (in SCLK cycles)
#define SSI_SPI_CTRLR0_WAIT_CYCLES_RESET  _u(0x00)
#define SSI_SPI_CTRLR0_WAIT_CYCLES_BITS   _u(0x0000f800)
#define SSI_SPI_CTRLR0_WAIT_CYCLES_MSB    _u(15)
#define SSI_SPI_CTRLR0_WAIT_CYCLES_LSB    _u(11)
#define SSI_SPI_CTRLR0_WAIT_CYCLES_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_INST_L
// Description : Instruction length (0/4/8/16b)
//               0x0 -> No instruction
//               0x1 -> 4-bit instruction
//               0x2 -> 8-bit instruction
//               0x3 -> 16-bit instruction
#define SSI_SPI_CTRLR0_INST_L_RESET      _u(0x0)
#define SSI_SPI_CTRLR0_INST_L_BITS       _u(0x00000300)
#define SSI_SPI_CTRLR0_INST_L_MSB        _u(9)
#define SSI_SPI_CTRLR0_INST_L_LSB        _u(8)
#define SSI_SPI_CTRLR0_INST_L_ACCESS     "RW"
#define SSI_SPI_CTRLR0_INST_L_VALUE_NONE _u(0x0)
#define SSI_SPI_CTRLR0_INST_L_VALUE_4B   _u(0x1)
#define SSI_SPI_CTRLR0_INST_L_VALUE_8B   _u(0x2)
#define SSI_SPI_CTRLR0_INST_L_VALUE_16B  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_ADDR_L
// Description : Address length (0b-60b in 4b increments)
#define SSI_SPI_CTRLR0_ADDR_L_RESET  _u(0x0)
#define SSI_SPI_CTRLR0_ADDR_L_BITS   _u(0x0000003c)
#define SSI_SPI_CTRLR0_ADDR_L_MSB    _u(5)
#define SSI_SPI_CTRLR0_ADDR_L_LSB    _u(2)
#define SSI_SPI_CTRLR0_ADDR_L_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : SSI_SPI_CTRLR0_TRANS_TYPE
// Description : Address and instruction transfer format
//               0x0 -> Command and address both in standard SPI frame format
//               0x1 -> Command in standard SPI format, address in format
//               specified by FRF
//               0x2 -> Command and address both in format specified by FRF
//               (e.g. Dual-SPI)
#define SSI_SPI_CTRLR0_TRANS_TYPE_RESET      _u(0x0)
#define SSI_SPI_CTRLR0_TRANS_TYPE_BITS       _u(0x00000003)
#define SSI_SPI_CTRLR0_TRANS_TYPE_MSB        _u(1)
#define SSI_SPI_CTRLR0_TRANS_TYPE_LSB        _u(0)
#define SSI_SPI_CTRLR0_TRANS_TYPE_ACCESS     "RW"
#define SSI_SPI_CTRLR0_TRANS_TYPE_VALUE_1C1A _u(0x0)
#define SSI_SPI_CTRLR0_TRANS_TYPE_VALUE_1C2A _u(0x1)
#define SSI_SPI_CTRLR0_TRANS_TYPE_VALUE_2C2A _u(0x2)
// =============================================================================
// Register    : SSI_TXD_DRIVE_EDGE
// Description : TX drive edge
#define SSI_TXD_DRIVE_EDGE_OFFSET _u(0x000000f8)
#define SSI_TXD_DRIVE_EDGE_BITS   _u(0x000000ff)
#define SSI_TXD_DRIVE_EDGE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : SSI_TXD_DRIVE_EDGE_TDE
// Description : TXD drive edge
#define SSI_TXD_DRIVE_EDGE_TDE_RESET  _u(0x00)
#define SSI_TXD_DRIVE_EDGE_TDE_BITS   _u(0x000000ff)
#define SSI_TXD_DRIVE_EDGE_TDE_MSB    _u(7)
#define SSI_TXD_DRIVE_EDGE_TDE_LSB    _u(0)
#define SSI_TXD_DRIVE_EDGE_TDE_ACCESS "RW"
// =============================================================================
#endif // HARDWARE_REGS_SSI_DEFINED
